       DCL-F SHIFTWEEK DISK USAGE(*INPUT) KEYED RENAME(SHIFTWEEK:SHIFTWEEKR);
       DCL-F SHIFTRATES DISK USAGE(*INPUT) RENAME(SHIFTRATES:SHIFTRATER);

       DCL-F PAYRPT PRINTER OFLIND(*IN01);
       DCL-F PAYSUMMARY WORKSTN;

       DCL-S HOURSOVER PACKED(3);

       READ SHIFTRATES;
       WRITE TITLE;
       WRITE COLHDG;
       READ SHIFTWEEK;

       DOW NOT %EOF;
         EXSR PAYSR;

         IF *IN01;
           WRITE TITLE;
           WRITE COLHDG;
           *IN01 = *OFF;
         ENDIF;

         WRITE EMPDETAIL;
         READ SHIFTWEEK;
       ENDDO;

       EVAL(H) TOTWKPAY = TOTOVTPAY + TOTREGPAY;
       WRITE TOTALS;
       DAYHOURS =  DAYHRS;
       AFTHOURS =  AFTHRS;
       NGTHOURS =  NIGHTHRS;
       REGPAY = TOTREGPAY;
       OVRPAY = TOTOVTPAY;
       TTLPAYOUT = TOTWKPAY;
       EXFMT RECORD1;


       *INLR = *ON;
       RETURN;

       BEGSR PAYSR;
         SELECT;
           WHEN WORKSHIFT = '1';
             HOURLYRATE = DAYHRS;
           WHEN WORKSHIFT = '2';
             HOURLYRATE = AFTHRS;
           WHEN WORKSHIFT = '3';
             HOURLYRATE = NIGHTHRS;
         ENDSL;

         SELECT;
           WHEN PAYCLASS = 1;
            EVAL(H) HOURLYRATE = HOURLYRATE + 0.094 * HOURLYRATE;
           WHEN PAYCLASS = 2;
            EVAL(H) HOURLYRATE = HOURLYRATE + 0.062 * HOURLYRATE;
           WHEN PAYCLASS = 3;
            EVAL(H) HOURLYRATE = HOURLYRATE - 0.043 * HOURLYRATE;
         ENDSL;

         IF HRSWORKED > 40;
           HOURSOVER = HRSWORKED - 40;
           EVAL(H) REGULARPAY = 40 * HOURLYRATE;
           EVAL(H) OVERPAY = HOURSOVER * 1.5 * HOURLYRATE;
         ELSE;
           EVAL(H) REGULARPAY = HRSWORKED * HOURLYRATE;
           OVERPAY = 0;
         ENDIF;

        EVAL(H) WEEKLYPAY = REGULARPAY + OVERPAY;

        EVAL(H) TOTREGPAY = TOTREGPAY + REGULARPAY;
        EVAL(H) TOTOVTPAY = TOTOVTPAY + OVERPAY;
       ENDSR;


